---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotAssignSecondaryDistSysToCircuit
source: html/0b4a1f92-32dd-6405-fff4-349d09deadd7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotAssignSecondaryDistSysToCircuit Property

Cannot assign or add [Element] to Circuit. There is no assigned secondary distribution system for [Element].

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAssignSecondaryDistSysToCircuit { get; }
```